<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<div id="cityListDiv" title="全国城市列表" style="display:none">
<div id="cityTabs" style="width:100%">
<ul>
<li><a href="#pinyinTab">按拼音排序</a></li>
<li><a href="#areaTab">按地区排序</a></li>
</ul>
<div id="pinyinTab"></div>
<div id="areaTab"></div>
</div>
</div>
<script type="text/javascript">
if("undefined"==typeof citylist){
	var citylist={
	};
}
citylist.hot_city = ["北京","上海","广州","深圳","杭州","苏州","成都","济南","郑州","青岛","沈阳","天津","重庆","武汉","长沙"];
citylist.city = {
"A":["安庆","鞍山","安阳","安康","安顺","阿坝藏族羌族自治州","阿拉善盟","阿里地区","阿克苏地区","阿勒泰地区","澳门"],
"B":["北京","保定","宝鸡","本溪","包头","蚌埠","北海","亳州","巴中","毕节地区","滨州","白城","白山","白银","博尔塔拉蒙古自治州","百色","白沙县","保亭县","巴彦淖尔盟","巴音郭楞州","保山"],
"C":["成都","重庆","长春","长沙","巢湖","潮州","常德","承德","常州","池州","滁州","郴州","赤峰","长治","沧州","朝阳","崇左","楚雄彝族自治州","昌吉回族自治州","昌江县","澄迈县","昌都地区"],
"D":["大连","东莞","大庆","丹东","德州","德阳","东营","大同","定西","达州","大兴安岭地区","大理白族自治州","定安县","东方","东沙群岛","儋州","德宏州","迪庆州"],
"E":["鄂尔多斯","鄂州","恩施土家族苗族自治州"],
"F":["福州","佛山","抚顺","凤凰","防城港","阜阳","阜新"],
"G":["广州","贵阳","桂林","赣州","贵港","广安","广元","甘孜藏族自治州","甘南州","固原","果洛州"],
"H":["衡阳","黄山","合肥","邯郸","惠州","杭州","海口","湖州","黄石","葫芦岛","哈尔滨","呼和浩特","淮北","淮南","淮安","河源","河池","贺州","黑河","黄冈","鹤壁","衡水","菏泽","怀化","鹤岗","呼伦贝尔","汉中","海东地区","海北藏族自治州","海南藏族自治州","海西蒙古族藏族自治州","红河哈尼族彝族自治州","黄南州","哈密地区","和田地区"],
"I":[],
"J":["焦作","荆州","荆门","吉林","江门","揭阳","金华","金昌","嘉兴","九江","锦州","济南","佳木斯","景德镇","济宁","济源","吉安","晋城","晋中","酒泉","鸡西","嘉峪关"],
"K":["昆明","克拉玛依","开封","喀什地区","克孜勒苏州"],
"L":["廊坊","乐山","柳州","洛阳","泸州","辽阳","辽源","陇南","连云港","聊城","临汾","临沂","丽水","六安","兰州","吕梁","娄底","拉萨","来宾","漯河","莱芜","龙岩","临夏回族自治州","凉山彝族自治州","六盘水","乐东黎族自治县","临高县","陵水黎族自治县","林芝地区","丽江","临沧地区"],
"M":["茂名","梅州","眉山","绵阳","马鞍山","牡丹江"],
"N":["南京","南通","宁德","宁波","南宁","南昌","内江","南充","南平","南阳","南沙群岛","那曲地区","怒江州"],
"O":[],
"P":["莆田","盘锦","平顶山","平凉","濮阳","攀枝花","萍乡","普洱"],
"Q":["青岛","泉州","秦皇岛","齐齐哈尔","七台河","庆阳","曲靖","清远","潜江","钦州","黔东南苗族侗族自治州","黔南布依族苗族自治州","黔西南州","琼海","琼中黎族苗族自治县"],
"R":["日照","日喀则地区"],
"S":["上海","韶关","汕头","汕尾","深圳","三亚","四平","苏州","十堰","沈阳","绍兴","邵阳","石家庄","绥化","随州","三明","三门峡","上饶","双鸭山","商丘","商洛","宿州","宿迁","山南地区","朔州","松原","石嘴山","石河子","遂宁","神农架林区"],
"T":["天津","太原","唐山","台州","泰州","泰安","吐鲁番地区","塔城地区","天水","天门","铁岭","通化","通辽","铜仁地区","铜陵","铜川","屯昌县"],
"U":[],
"V":[],
"W":["芜湖","无锡","温州","武汉","潍坊","威海","乌兰察布","乌海","吴忠","梧州","乌鲁木齐","武威","渭南","万宁","文昌","五指山","文山州"],
"X":["厦门","咸阳","西安","湘潭","襄樊","许昌","新乡","徐州","仙桃","信阳","孝感","忻州","新余","西宁","咸宁","宣城","邢台","兴安盟","西双版纳傣族自治州","湘西土家族苗族自治州","西沙群岛","锡林郭勒盟","香港"],
"Y":["宜宾","营口","阳江","延安","岳阳","玉溪","宜昌","盐城","烟台","扬州","伊春","榆林","玉林","益阳","云浮","运城","宜春","鹰潭","永州","银川","阳泉","雅安","伊犁哈萨克自治州","延边朝鲜族自治州","玉树州"],
"Z":["漳州","珠海","湛江","肇庆","中山","株洲","郑州","舟山","镇江","自贡","淄博","资阳","张家界","张家口","遵义","驻马店","中卫","周口","张掖","昭通","枣庄","中沙群岛的岛礁及其海域"]
};

citylist.hot_areacity = ["北京","上海","广州","深圳","杭州","苏州","成都","济南","郑州","青岛","沈阳","天津","重庆","武汉","长沙"];
citylist.areacity = {
"澳  门":["澳门"],	
"安徽省":["合肥","蚌埠","芜湖","马鞍山","安庆","黄山","巢湖","亳州","六安","宣城","宿州","池州","淮北","淮南","滁州","铜陵","阜阳"],
"福建省":["福州","厦门","宁德","莆田","泉州","漳州","三明","南平","龙岩"],
"广东省":["深圳","珠海","佛山","肇庆","汕头","湛江","中山","潮州","东莞","汕尾岛","阳江","揭阳","茂名","江门","韶关","惠州","梅州","云浮","河源","清远"],
"广西省":["南宁","柳州","桂林","北海","防城港","崇左","来宾","梧州","河池","玉林","贵港","贺州","钦州","百色"],
"贵州省":["贵阳","安顺","毕节地区","遵义","铜仁地区","黔东南苗族侗族自治州","黔南布依族苗族自治州","六盘水","黔西南州"],
"甘肃省":["兰州","天水","定西","平凉","庆阳","张掖","武威","白银","酒泉","金昌","陇南","临夏回族自治州","甘南州","嘉峪关"],
"河北省":["邯郸","石家庄","保定","张家口","承德","唐山","廊坊","秦皇岛","沧州","衡水","邢台"],
"河南省":["郑州","安阳","新乡","许昌","平顶山","开封","洛阳","焦作","三门峡","信阳","南阳","周口","商丘","济源","漯河","濮阳","驻马店","鹤壁"],
"湖北省":["武汉","襄樊","鄂州","黄石","荆州","宜昌","十堰","荆门","仙桃","咸宁","天门","孝感","潜江","随州","黄冈","神农架林区","恩施土家族苗族自治州"],
"湖南省":["岳阳","长沙","湘潭","株洲","衡阳","常德","凤凰","张家界","娄底","怀化","永州","益阳","邵阳","郴州","湘西土家族苗族自治州"],
"黑龙江":["哈尔滨","齐齐哈尔","牡丹江","大庆","佳木斯","七台河","伊春","双鸭山","大兴安岭地区","绥化","鸡西","鹤岗","黑河"],
"海南省":["海口","三亚","白沙县","保亭县","昌江县","澄迈县","定安县","东方","东沙群岛","乐东黎族自治县","临高县","陵水黎族自治县","南沙群岛","琼海","琼中黎族苗族自治县","屯昌县","万宁","文昌","五指山","西沙群岛","中沙群岛的岛礁及其海域","儋州"],
"吉林省":["长春","吉林","四平","延边朝鲜族自治州","松原","白城","白山","辽源","通化"],
"江苏省":["南京","无锡","镇江","苏州","南通","扬州","盐城","徐州","连云港","常州","泰州","宿迁","淮安"],
"江西省":["南昌","九江","景德镇","吉安","宜春","抚州","新余","萍乡","赣州","鹰潭","上饶"],
"辽宁省":["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","辽阳","盘锦","葫芦岛","朝阳","铁岭","阜新"],
"内蒙古":["呼和浩特","包头","乌兰察布","乌海","兴安盟","呼伦贝尔","赤峰","通辽","鄂尔多斯","阿拉善盟","巴彦淖尔盟","锡林郭勒盟"],
"宁夏省":["银川","中卫","吴忠","石嘴山","固原"],
"青海省":["西宁","海东地区","海北藏族自治州","海南藏族自治州","果洛州","黄南州","玉树州","海西蒙古族藏族自治州"],
"山西省":["太原","临汾","吕梁","大同","忻州","晋中","晋城","朔州","运城","长治","阳泉"],
"山东省":["济南","青岛","淄博","德州","烟台","潍坊","泰安","东营","威海","临沂","日照","枣庄","济宁","滨州","聊城","莱芜","菏泽"],
"陕西省":["西安","咸阳","延安","宝鸡","商洛","安康","榆林","汉中","渭南","铜川"],
"四川省":["成都","自贡","绵阳","泸州","宜宾","内江","资阳","乐山","眉山","凉山彝族自治州","南充","巴中","广元","广安","德阳","攀枝花","甘孜藏族自治州","达州","遂宁","阿坝藏族羌族自治州","雅安"],
"新　疆":["乌鲁木齐","伊犁哈萨克自治州","克拉玛依","博尔塔拉蒙古自治州","吐鲁番","塔城地区","昌吉回族自治州","石河子","阿克苏地区","阿勒泰地区","巴音郭楞州","哈密地区","和田地区","喀什地区","克孜勒苏州"],
"香  港":["香港"],
"西　藏":["拉萨","山南地区","日喀则地区","阿里地区","昌都地区","林芝地区","那曲地区"],
"云南省":["昆明","玉溪","大理白族自治州","昭通","曲靖","楚雄彝族自治州","红河哈尼族彝族自治州","西双版纳傣族自治州","保山","德宏州","迪庆州","丽江","临沧地区","怒江州","普洱","文山州"],
"浙江省":["杭州","嘉兴","绍兴","湖州","宁波","台州","温州","金华","舟山","丽水","衢州"]
};
var $ul_1 = $("<ul></ul>");
var htmlContent = "<ul>";
for(var h=0;h<citylist.hot_city.length;++h){
	htmlContent += "<li><strong><a style=\"color:#ff3399\" href=\"javascript:selectCity('"+citylist.hot_city[h]+"')\">"+citylist.hot_city[h]+"</a></strong></li>";
}
htmlContent += "</ul>";
$("#pinyinTab").append($(htmlContent));
$("#cityTabs").tabs({
	event: 'mouseover'	
});
function citylistBox(){
	$("#cityListDiv").dialog({
		bgiframe: true,
		model: true,
		position: 'center',
		height: 488,
		width: 716
	});
}
function selectCity(cityName){
	setCurrentCity(cityName);
	$("#cityListDiv").dialog("close");
}
</script>